In [1]:
a = [1,2,3]
b = [2,3,4]

In [2]:
for f,s in zip(a,b):
    print(f*s)

2
6
12

In [3]:
[f*s for f,s in zip(a,b)]

[2, 6, 12]

In [5]:
import numpy

In [6]:
a = numpy.array([1,2,3])
b = numpy.array([2,3,4])
type(a)

numpy.ndarray

In [7]:
a * b

array([ 2,  6, 12])

In [13]:
import numpy as np
na=np.array([['name','gender','age'],['frank','M','29'],['mary','F','23'],['tom','M','35'],['ted','M','33'],['jean','F','21'],['lisa','F','20']],dtype='<U6')

In [14]:
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U6')

In [17]:
import pandas as pd
df=pd.DataFrame([['frank','M','29'],['mary','F','23'],['tom','M','35'],['ted','M','33'],['jean','F','21'],['lisa','F','20']])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [18]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [19]:
df.columns=['name','gender','age']#加列名
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [20]:
df.columns

Index(['name', 'gender', 'age'], dtype='object')

In [21]:
#Series

In [22]:
phone = pd.Series([21000,18900,18000])
phone

0    21000
1    18900
2    18000
dtype: int64

In [23]:
phone = pd.Series([21000,18900,18000],index = ['Iphone','Oppo','Moto'])
phone

Iphone    21000
Oppo      18900
Moto      18000
dtype: int64

In [24]:
phone[1]

18900

In [25]:
phone[1:3]

Oppo    18900
Moto    18000
dtype: int64

In [26]:
phone['Oppo']

18900

In [27]:
import pandas as pd
df=pd.DataFrame([['frank','M','29'],['mary','F','23'],['tom','M','35'],['ted','M','33'],['jean','F','21'],['lisa','F','20']])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [28]:
df.columns = ['name','gender','age']
df

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35
3    ted      M  33
4   jean      F  21
5   lisa      F  20

In [29]:
df.head(3)#前3列

    name gender age
0  frank      M  29
1   mary      F  23
2    tom      M  35

In [30]:
df.tail(3)#后3列

   name gender age
3   ted      M  33
4  jean      F  21
5  lisa      F  20

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name      6 non-null object
gender    6 non-null object
age       6 non-null object
dtypes: object(3)
memory usage: 224.0+ bytes

In [32]:
df.describe()#描述性统计

        name gender age
count      6      6   6
unique     6      2   6
top     jean      F  33
freq       1      3   1